In [37]:
import pandas as pd

In [38]:
df= pd.DataFrame({"a": [1,2,4],"b": [5,10,15]})
df

   a   b
0  1   5
1  2  10
2  4  15

In [39]:
mask = df.a==2

In [40]:
l = df[mask]*2

In [41]:
l

   a   b
1  4  20

In [42]:
df[mask]

   a   b
1  2  10

In [43]:
df.loc[mask] = l

In [44]:
df

   a   b
0  1   5
1  4  20
2  4  15

In [45]:
df = l

In [36]:
df

   a   b
1  4  20